{
  "books": [
    {
      "name": "The Stand-In",
      "image": "images/standin.webp",
      "author": "Lily Chu",
      "genre": "Romance",
      "description": "Gracie Reed, fresh from losing her job and struggling to care for her mother, is plunged into glamour when she's mistaken for Chinese star Wei Fangli. As a stand‑in, she navigates luxury, growing attraction to Fangli's co-star Sam, and discovers her own strength, identity, and heart.",
      "review": "⭐⭐⭐⭐",
      "purchaselink": "https://www.amazon.com/Stand-Lily-Chu/dp/1728242622",
      "longreview" : "Gracie Reed’s accidental dive into celebrity life is both hilarious and heartwarming. Chu balances romantic tension with emotional depth, crafting a story that feels like a comforting rom-com with real heart. The chemistry between Gracie and Sam is electric, and the self-discovery arc is satisfying. One star shy of perfect only because the pacing lags slightly in the middle."
    },
    {
      "name": "Everything All At Once",
      "image": "images/everything.webp",
      "author": "Katrina Leno",
      "genre": "Coming-of-Age",
      "description": "Lottie Reaves is anxious and risk‑averse until her beloved Aunt Helen dies, leaving behind 24 mysterious letters. Each one challenges her to face fear, grieve, and live boldly. Along the way, she discovers family secrets, friendship, love, and the profound power of stories.",
      "review": "⭐⭐⭐⭐",
      "purchaselink": "https://www.amazon.com/Everything-All-Once-Katrina-Leno/dp/0062493094",
      "longreview" : "This book is a quiet triumph. Leno captures grief, anxiety, and growth with lyrical beauty and tenderness. Lottie’s journey, prompted by her aunt’s mysterious letters, is both emotionally raw and deeply inspiring. It’s a coming-of-age tale that doesn’t shy away from the messiness of life. Some plot elements feel slightly underdeveloped, but overall it’s a gem."
    },
    {
      "name": "Warcross",
      "image": "images/warcross.webp",
      "author": "Marie Lu",
      "genre": "Science Fiction",
      "description": "Teen hacker Emika Chen scrapes by hunting cheaters in the VR sensation Warcross—until her rogue hack into the world championships makes her an unexpected star. Recruited by creator Hideo Tanaka to spy on the tournament, she uncovers a dangerous conspiracy, forcing her to choose whom to trust.",
      "review": "⭐⭐⭐⭐⭐",
      "purchaselink": "https://www.amazon.com/Warcross-Marie-Lu/dp/0399547967",
      "longreview" : "Absolutely gripping from page one. Emika Chen is a fierce, flawed, and brilliant protagonist who sucks you into the Warcross world with style. Marie Lu builds a dazzling, high-stakes virtual world with just enough romance and betrayal to keep your heart racing. A sci-fi triumph that hits every note perfectly. This one’s a total win."
    },
    {
      "name": "Wildcard",
      "image": "images/wildcard.webp",
      "author": "Marie Lu",
      "genre": "Science Fiction",
      "description": "Emika Chen survives the Warcross finale, only to uncover Hideo’s dangerous NeuroLink algorithm. With a bounty on her head, she allies with Zero and the Blackcoats in neon‑lit Tokyo. Trust shattered and freedom at stake, Emika risks everything—including love—to stop a looming tech‑controlled future.",
      "review": "⭐⭐⭐⭐⭐",
      "purchaselink": "https://www.amazon.com/Wildcard-Warcross-Marie-Lu/dp/0399547991",
      "longreview" : "A thrilling sequel that somehow tops the first! Lu raises the stakes without sacrificing character depth. Emika’s moral dilemmas feel real, and the action scenes are cinematic. Neon-soaked Tokyo, hacking drama, and a dash of romance? Yes, please. Wildcard is a satisfying, emotional, and thought-provoking end to a brilliant duology."
    },
    {
      "name": "Renegades",
      "image": "images/renegades.webp",
      "author": "Marissa Meyer",
      "genre": "Fantasy",
      "description": "Nova is a gifted anarchist with a grudge against the Renegades—superheroes who promised peace but failed her. Disguised, she infiltrates their ranks to bring them down from within. But as secrets unravel and loyalties blur, Nova must decide where her true allegiance lies—in vengeance or hope.",
      "review": "⭐⭐⭐",
      "purchaselink": "https://www.amazon.com/Renegades-Marissa-Meyer/dp/1250044669",
      "longreview" : "Great concept, uneven execution. Nova’s double life as both anarchist and infiltrator adds tension, but the pacing is slow and the romance feels forced. There’s promise in the worldbuilding and some great twists, but it takes too long to really hook. Solid read for superhero fans, but not Meyer’s strongest."
    },
    {
      "name": "Aurora Rising",
      "image": "images/aurorarising.webp",
      "author": "Amie Kaufman | Jay Kristoff",
      "genre": "Science Fiction",
      "description": "In 2380, misfit cadet Tyler and his squad—including the legendary Aurora—are thrown into a galaxy-threatening mission. Battling deadly forces and unraveling conspiracies, they must learn to trust each other to survive. Friendship, sacrifice, and destiny collide in this thrilling sci-fi adventure among the stars.",
      "review": "⭐⭐⭐⭐⭐",
      "purchaselink": "https://www.amazon.com/Aurora-Rising-Cycle-Amie-Kaufman/dp/1524720968",
      "longreview" : "What a ride! This book blends banter, heartache, and high-octane space action like no other. The squad dynamic is perfection—each character feels real and essential. The stakes are high, but the humor cuts the tension perfectly. If Firefly and Guardians of the Galaxy had a YA baby, this would be it."
    },
    {
      "name": "Aurora Burning",
      "image": "images/auroraburning.webp",
      "author": "Amie Kaufman | Jay Kristoff",
      "genre": "Science Fiction",
      "description": "The squad faces new dangers across the galaxy as secrets and betrayals surface. Tyler and Aurora must confront their pasts and unite to stop a deadly threat. With high stakes, fierce loyalty, and unexpected alliances, their fight for survival becomes a battle for the universe’s future.",
      "review": "⭐⭐⭐⭐⭐",
      "purchaselink": "https://www.amazon.com/Aurora-Burning-Cycle-Amie-Kaufman/dp/1524720925",
      "longreview" : "Even better than the first. Secrets unravel, betrayals sting, and the characters dig deeper into who they are and what they stand for. The emotional moments hit hard, and the sci-fi twists are endlessly surprising. This is the kind of sequel that makes you want to reread book one immediately."
    },
    {
      "name": "Aurora's End",
      "image": "images/aurorasend.webp",
      "author": "Amie Kaufman | Jay Kristoff",
      "genre": "Science Fiction",
      "description": "The epic conclusion finds Tyler, Aurora, and their crew facing their most perilous mission yet. As alliances shatter and enemies close in, they must make impossible choices to save humanity. Love, sacrifice, and destiny intertwine in this thrilling finale to the Aurora Cycle trilogy.",
      "review": "⭐⭐⭐⭐⭐",
      "purchaselink": "https://www.amazon.com/Auroras-Aurora-Cycle-Amie-Kaufman/dp/1524720887",
      "longreview" : "An explosive, emotional conclusion. The final installment pulls no punches—sacrifices are made, hearts are broken, and destinies fulfilled. Every loose thread ties up in a way that feels earned. You'll cry, cheer, and maybe even scream a little. The Aurora Cycle ends not with a whimper, but with a cosmic bang."
    },
    {
      "name": "The Nature of Small Birds",
      "image": "images/smallbirds.webp",
      "author": "Susie Finkbeiner",
      "genre": "Historical Fiction",
      "description": "Told through three timelines, this heartfelt story follows a family shaped by the adoption of a Vietnamese daughter after the war. It's a gentle, uplifting look at love, belonging, and the quiet strength of family over decades.",
      "review": "⭐⭐⭐⭐",
      "purchaselink": "https://www.amazon.com/Nature-Small-Birds-Susie-Finkbeiner/dp/0800739344",
      "longreview" : "Quiet, touching, and full of grace. This multi-generational story unfolds gently, revealing the beauty of family and identity across decades. It’s not flashy or fast-paced, but that’s the point—it lingers in the heart like a favorite memory. A lovely read for those who appreciate character-driven fiction."
    },
    {
      "name": "To All the Boys I’ve Loved Before",
      "image": "images/toalltheboys.webp",
      "author": "Jenny Han",
      "genre": "Romance",
      "description": "When Lara Jean’s secret love letters are unexpectedly sent out, her quiet high school life turns upside down. This sweet and wholesome teen romance explores first love, family, and growing up with humor and heart.",
      "review": "⭐⭐⭐⭐",
      "purchaselink": "https://www.amazon.com/All-Boys-Ive-Loved-Before/dp/1442426705",
      "longreview" : "Sweet, swoony, and surprisingly heartfelt. Lara Jean is relatable and charming, and her messy love life unfolds with humor and sincerity. It’s light without being shallow and hits all the right emotional beats. Perfect for fans of wholesome romance, though a bit predictable at times."
    },
    {
      "name": "The Guernsey Literary and Potato Peel Pie Society",
      "image": "images/guernsey.webp",
      "author": "Mary Ann Shaffer & Annie Barrows",
      "genre": "Historical Fiction",
      "description": "Set just after WWII, a writer discovers a quirky book club on Guernsey Island. Through letters, she uncovers their stories of wartime survival and love. Warm, witty, and full of charm—with clean content and rich emotion.",
      "review": "⭐⭐⭐⭐⭐",
      "purchaselink": "https://www.amazon.com/Guernsey-Literary-Potato-Peel-Society/dp/0385341008",
      "longreview" : "Absolutely delightful. The epistolary format brings the characters to life with warmth and wit. It's a rare book that balances post-war grief with humor and hope so seamlessly. The island setting, quirky characters, and literary love make this an instant favorite. Charming in every possible way."
    },
    {
      "name": "The Bookshop on the Corner",
      "image": "images/bookshopcorner.webp",
      "author": "Jenny Colgan",
      "genre": "Casual Read",
      "description": "After losing her job, Nina moves to a small Scottish village and opens a traveling bookshop. With gentle romance, bookish joy, and small-town charm, this is a cozy, clean read perfect for bibliophiles.",
      "review": "⭐⭐⭐⭐",
      "purchaselink": "https://www.amazon.com/Bookshop-Corner-Novel-Jenny-Colgan/dp/0062467255",
      "longreview" : "Book lovers, rejoice! This cozy tale of reinvention and rural charm is as comforting as a cup of tea. Nina is instantly likable, and the Scottish setting feels like a hug. A few plot points feel predictable, but the heart and humor more than make up for it."
    },
    {
      "name": "A Man Called Ove",
      "image": "images/ove.webp",
      "author": "Fredrik Backman",
      "genre": "Casual Fiction",
      "description": "Grumpy, rule-obsessed Ove finds unexpected friendship in his lively new neighbors. Heartwarming and often hilarious, this international favorite explores grief, connection, and the power of kindness—with mild language but otherwise clean content.",
      "review": "⭐⭐⭐⭐⭐",
      "purchaselink": "https://www.amazon.com/Man-Called-Ove-Novel/dp/1476738025",
      "longreview" : "This book will steal your heart. Ove is gruff, stubborn, and completely lovable. Backman writes with a blend of humor and heartbreak that makes every chapter a joy. The supporting cast is just as vibrant. You’ll laugh, you’ll cry, and you’ll never forget Ove. An absolute must-read."
    },
    {
      "name": "The Two Lives of Lydia Bird",
      "image": "images/lydiabird.webp",
      "author": "Josie Silver",
      "genre": "Romance",
      "description": "After her fiancé’s death, Lydia wakes up in an alternate life where he’s still alive. A poignant and gentle love story about grief, healing, and moving on—with emotion but little to no explicit content.",
      "review": "⭐⭐⭐⭐",
      "purchaselink": "https://www.amazon.com/Two-Lives-Lydia-Bird-Novel/dp/0593135232",
      "longreview" : "A moving exploration of grief and love. Lydia’s dual-reality journey is both heartbreaking and healing. Silver writes emotional depth with subtlety, and the love triangle—between a life lost and one ahead—is compelling. A touch slow in places, but ultimately uplifting and satisfying."
    },
    {
      "name": "The Hiding Place",
      "image": "images/hidingplace.webp",
      "author": "Corrie ten Boom",
      "genre": "Historical / Memoir",
      "description": "Corrie ten Boom's true story of courage and faith during WWII is a moving account of sacrifice and forgiveness. This Christian memoir is clean, powerful, and inspiring for readers of all ages.",
      "review": "⭐⭐⭐⭐⭐",
      "purchaselink": "https://www.amazon.com/Hiding-Place-Corrie-ten-Boom/dp/0553256696",
      "longreview" : "Powerful, unforgettable, and deeply spiritual. Corrie ten Boom’s courage and faith shine through every page. The horrors of WWII are not sugar-coated, but the focus remains on hope and forgiveness. A must-read memoir that stays with you long after the last page."
    },
    {
      "name": "Atomic Habits",
      "image": "images/atomichabits.webp",
      "author": "James Clear",
      "genre": "Self-Help",
      "description": "This practical guide to habit change explains how small daily actions create big results. It's clean, motivational, and full of real-life examples for building a better life without burnout.",
      "review": "⭐⭐⭐⭐⭐",
      "purchaselink": "https://www.amazon.com/Atomic-Habits-Proven-Build-Break/dp/0735211299",
      "longreview" : "Life-changing without the fluff. James Clear distills complex behavior science into actionable, motivating advice. The examples are practical, the tips easy to apply, and the overall tone incredibly empowering. Whether you're overhauling your life or just trying to drink more water, this book delivers."
    },
    {
      "name": "The Magnolia Story",
      "image": "images/magnoliastory.webp",
      "author": "Chip and Joanna Gaines",
      "genre": "Memoir / Self-Help",
      "description": "HGTV stars Chip and Joanna Gaines share their journey of marriage, business, faith, and family. Told with humor and warmth, this clean, heartfelt memoir inspires with its simplicity and grit.",
      "review": "⭐⭐⭐⭐",
      "purchaselink": "https://www.amazon.com/Magnolia-Story-Chip-Gaines/dp/0718079183",
      "longreview" : "Wholesome, funny, and full of charm. Chip and Joanna’s story is relatable and inspiring without being preachy. Their love, work ethic, and faith are refreshing to read about. Some parts feel a little too polished, but fans of the show will adore this peek behind the curtain."
    },
    {
      "name": "The Secret Garden",
      "image": "images/secretgarden.webp",
      "author": "Frances Hodgson Burnett",
      "genre": "Classic / Historical",
      "description": "After tragedy, spoiled Mary Lennox discovers a neglected garden and a new way of living. This classic story of renewal and kindness remains beloved for its clean storytelling and hopeful themes.",
      "review": "⭐⭐⭐⭐⭐",
      "purchaselink": "https://www.amazon.com/Secret-Garden-Frances-Hodgson-Burnett/dp/006440188X",
      "longreview" : "A timeless classic that blooms with every reread. Mary’s transformation is heartwarming, and the garden itself feels almost magical. It’s a story of healing, kindness, and growth that transcends age. Clean, sweet, and filled with wonder—it’s a must for every bookshelf."
    }
  ]
}